["After taking karate lessons, Austin taught the bully a lesson by punching in the face.", "Casey took her chances with Austin by going on a first date with him. They had a good time.", "Aubrey told the waitress what she wanted to order, and the waitress went on her way.", "Carson attended school for three years, until they got kicked out.", "Casey extended Tracy's hand during the massage, stretching out the tense muscles for relief.", "Jordan took to cooking like a duck to water and graduated cooking school at the top of her class.", "Carson's computer was running slow more days than not. Carson wanted a new computer to fix the issue.", "Taylor laughed while taking a sip of soda.  This had an unfortunate result which she would feel bad about.", "Skylar did their utmost to help and so they got some cookies to feed their hunger.", "Addison put their friend in the trunk of the car and then drove away very quickly.", "While tending Austin's garden, Tracy placed a shade over the garden to protect Austin's flowers from the sun.", "Aubrey wanted to know the price of the specials, so Aubrey asked the waitress a question.", "Addison gave their support for Sasha's position in the debate, even though it was an unpopular one.", "Even though their partner said it looked gross, Bailey loved their beard.", "Ash held the cross in the church and took it down from the wall for a few minutes.", "Ash ordered a big sandwich at the deli because they are very hungry.  Ash put $3 in a tip jar.", "Alex saw Taylor last night while they were on a date with someone, who wasn't their spouse.", "While it wasn't their intention to be mean, the friends did not include Kai in their weekend plans as Kai spoke too loud and too often and Kai gave people headaches.", "Bailey was in a fight and was told the school would be sending an expulsion notice.", "Alex realized that his sink was leaking. Alex called his landlord.", "Carson wanted to put away a tent. They pulled up stakes.", "Quinn used Casey's hand to help Casey practice drawing, by guiding it across the paper.", "Quinn spent a lot of time with the Kai family with which they were staying in America.", "Alex fell out of the tall tree and heard a loud crack when they hit the ground.", "Alex and his friends planned to go to the gaming arcade. Alex played video games together with his friends.", "Sasha caused Jordan's reaction by sucking with her mouth and gently massaging balls with their hands.", "Quinn came down to see us. That was kind of them.", "Jesse was having a hard time understanding the situation, so Jesse sought Sasha's explanation.", "Sydney told Jesse they could do the yard work for a few bucks an hour today.", "Robin followed their dream. Their goals would be made manifest.", "Sydney used their sewing machine to make a quilt out of scrap fabric and old T-shirts.", "Because Remy volunteered to mentor struggling students after school, she felt good that she played a role in shaping them.", "Casey asked Jesse to consult on their business plan.  Jesse increased Casey's profits.", "Sasha had gotten flowers from a secret admirer. Sasha bought a vase at a low price.", "Robin brought Kendall to the attention of police when she realized she was a wanted criminal.", "Kendall took them to the museum for the day. They wanted to educate their kids.", "Carson and their wife were doing a budget. Carson went to talk to their wife.", "Cameron was new at school and came to the office. Quinn created Cameron's file for him.", "Wanting to get in better overall shape, Addison ran 5 miles.", "Alex lived and let live so that they could live peacefully with other members of society.", "Carson got evicted from their apartment. They refused to pay rent on time.", "Skylar ordered Tracy to wash the dishes, fold the laundry, and vacuum the floor. Tracy obeyed Skylar's order and washed the dishes.", "Bailey wanted to spend some time with her family. They planned a whole day out together.", "Lee held hands during the pleasure moment and moans cravingly while her partner continued to move.", "Aubrey was thankful for all the support Sasha's mom gave her. Aubrey took Sasha's mom to lunch to thank her.", "Cameron was Kai's assistant for years, and Cameron served Kai faithfully.", "The business Carson worked for was looking to expand, so Carson moved things forward.", "The two business men were led into the woods by the mob thugs and then Austin was forced to dig their own graves.", "After getting the lead role in the ballet, Casey peformned their dance effectively.", "Sydney went to our family farm, taking the trash with her, and set it on fire on the ground.", "Jesse was hungry for cookies, so they decided to bake the cookies.", "Kendall was tossed the ball but couldn't make the shot. Kendall passed the ball to her teammate.", "Jesse faced every kind of evil person. There are pure evil people in this world.", "Riley came home from their camping trip with lice, so Riley shaved their hair off.", "After going on their first date, Alex kissed Lee deeply because he felt sparks fly.", "After being called out for failing the test, Casey turned bright red.", "Jordan had been through a lot of up and down in life so Jordan gave Austin a view of the future.", "Kendall and Skylar had been good friends for a long time, Kendall always had Skylar's back.", "Taylor's math test was that afternoon at school. Taylor tried very hard to pass it.", "Aubrey pulled the driver over for speeding. They then wrote a ticket,.", "After looking it over on the black board, Lee solved Taylor's equation.", "Addison put Quinn's arms down by their side, because Quinn was getting out of control and swinging wildly.", "Feeling a bit bored and tired, Kai watched anything.", "Kai knew that things were getting out of control and managed to keep his temper in check.", "Jordan did not want anyone to see her results so she pushed the envelope away from Skylar.", "Cameron walked his date to the door of her house. Cameron placed a soft kiss on their date before leaving.", "Their friends were trying to throw a big event, so Remy offered to help with the party.", "While it was hard being an exchange student far from home, Jesse loved Aubrey's family.", "Kai tried to cheer up his friend who just broke up with his girlfriend but he did not laugh. So Kai said another joke.", "Addison put Kendall's plan into action and was excited to bring Kendall her share of the profits.", "Jan had been competing for first place in a competition, and it was left up to Aubrey to decide Jan's fate.", "Jared said Austin's hair looked ugly, so Austin changed his hair colour.", "Jan went to the grocery store way out of town in order to buy some rare fruits and veggies.", "Robin knew that the local cafe would give their food to the people who really need it.", "Kai wasn't feeling so good and was in his room. Skylar made Kai feel better.", "Robin noticed that Lee did not have a lunch or money for lunch. Robin supplied Lee with food.", "Kendall saw Robin begin to tilt too far close to the cliff edge and grabbed Robin's hips.", "Sydney found the building on fire and had to call the fire department to put the flames out.", "It was time to take down the tent, so Carson pulled up the stakes.", "For his birthday, Riley treated her son to dinner at his favorite restaurant. Her son thanked her and said he had a wonderful birthday.", "They had a eating competition and the winner ate so many chicken wings that he had to go to the hospital.", "Sydney needed a new car after she got into a bad accident and totalled her old one.", "Austin took Bailey to the doctor after Bailey kept coughing up fluid in the middle of the night.", "Sydney was reading by the pool when Ash wanted Sydney to watch him do a dive he had been practicing, so Sydney watched for a moment.", "Quinn has had too many hours of work, but finally the weekend is her and Quinn slept like a baby.", "Sasha is a law abiding citizen. It's important to Sasha that they do everything right. ", "Bailey dropped a small stack of plates while putting away the clean dishes, so she apologized to her boss, who was nearby.", "Lee completed their application and as it was due today and gave it to Taylor who then filed it.", "Cameron, Jesse's son is full of energy.  He jumps up and down all the time, sometimes on furniture.", "Lee bought concert tickets for Remy's birthday for the concert that Remy wanted to go to.", "Janice won a trophy at the karate tournament. Bailey also got a trophy.", "ash realized he was about to run out of gas so he put fuel in the car.", "To optimize her results for purchasing the car, Aubrey stated the deal using different terms.", "Taylor had been sick so had missed a lot of school so had got a tutor to help them study and they worked very hard to make sure they caught up.", "Cameron had used Sydney's money well. They had everything they needed to start refurbishing the kitchen.", "Ash offered the job to the best candidate after thoroughly going through all of the applications.", "Remy was on a first date with Jordan, alone in their apartmen,t when they saw lust in Jordan's eyes.", "Austin was so excited for my re me they couldn't sleep because she got the role in the play.", "Jan was very tired, so to help her sleep, Tracy forced Jan's eyes closed for the night.", "Austin had been working as a tutor to make extra money for the last two years.  He likes doing this to help pay for his college education.", "Even though Sydney had not completed their earlier plans, Sydney introduced a plan further to amend.", "Jesse tried to stick it out through the storm but soon came to realize that they had to go.", "austin just got a new computer so the first thing he did was make an email.", "Austin was calling off of work, but his boss Cameron said he had to come in, changing Austin's plans.", "Skylar was speeding on a highway. They got a warning.", "Addison wanted to print the images he found online but realized his printer was not plugged in.", "Skylar doesn't like fishing, but their little brother wouldn't stop chattering about it. Skylar decides to take their little brother fishing.", "Quinn applied for a job as a waitress at Skylar's restaurant. Skylar couldn't stand the thought of working with a control freak every day, so they told the restaurant's owner that Quinn had a bad attitude.", "Casey loved politics, so she wanted to be class president.", "Cameron noticed Quinn having some troubles making friends with other. Cameron decided it was time to get Quinn a couple words of advice.", "Kendall was sick and needed to lay down, so Jan rested Kendall's forehead on the pillow.", "Cameron was very nervous about things, but Tracy made the Cameron evaluation better.", "Tracy took her son Austin to the beach. She used sunscreen to protect Austin's skin from the sun.", "Ash is an avid competitive gamer. Ash tried the hardest game Addison owned but was quickly defeated.", "Ash was about to step on a venomous snake. Quinn got Ash out of the way by force.", "Sasha picked the pink dress and after trying it on, she bought it at the store and brought it home.", "Wanting to share the information with everyone, Addison read an excerpt out loud.", "Cameron handed in her paper to get reviewed. When it came back Sydney had marked the paper with an asterisk.", "Tracy had a bad flu so Alex came to look after Tracy.  Alex fed Tracy soup then put Tracy to bed to get some rest.", "Cameron wasn't sure which one to decide, so he kept his options open.", "Jordan likes to bully people at school. Jordan hung louie by his underpants on the flag pole.", "Lee hit a pothole on the way to work and blew out a tire on his car. Lee realized that he left his wallet at home, which is two blocks away. He needed to call a tow truck and needed money to pay the driver.", "Taylor ran out of gas on the freeway. After getting some gas, Taylor returned to the station and filled their gas tank.", "Kai got out of the shower and picked her best outfit to go on a date.", "Casey was lying down in their bedroom.  Kai laid down on Casey's side.", "Kendall won the guitar at the local supermarket sweepstakes. Kendall took guitar lessons.\n\nPrompt word count: 4.", "Addison was busy all day and didn't have time to eat. She found some leftovers in the fridge. Addison ate the tacos that were left.", "Cameron needed to get change for the bus, so they looked through the couch cushions because they thought they might find money there.", "Quinn was high up in the tree and didn't want to get down. We told him we would play a game, so Quinn came down to us.", "Skylar used Jesse for other purposes and made Jesse make a cake with lots of chocolate.", "Remy recently moved from the country into a big city and was nervous about meeting people.", "Jesse was out running errands when she had to go to the bathroom. Jesse came all the way home to go.", "Remy was leaving to go off to college that afternoon. Cameron told Remy to call.", "Even though she was very popular and a cheerleader, Cameron was pretty bad at sports. Still, the boys picked her first for their team every time.", "It was Quinn's first day in the new college class, and Quinn paid attention to every detail that was said. They even took notes.", "Sydney had so much pent up emotion, they burst into tears at work.", "Sasha asked Lee's mom for her number so that she could stay in contact with Lee.", "Sasha expressed Skylar's thoughts in terms that Skylar was never able to put into words before.", "Tracy told Jan to take the lemonade, it was time to start the lemonade stand.", "Remy is a lonely nurse on the hospital's ICU night shift.  He doesn't normally interact with anyone on his rounds as most of the patients are asleep or in comas.  The one person he sees almost every night is Casey.  Remy has a bit of a crush on Casey.  For the years they've worked together, Remy has kept this a secret and just engaged in small talk with Casey, but inside he was falling more and more in love with her.  One Tuesday night, Remy brings a bunch of his prized possessions into work and gives them to Casey to show he likes her.", "Kai was a trained paramedic, so when he was swimming at Quinn´s house and saw his grandmother almost drown in the deep end of the pool, Kai gave aid to Quinn´s grandmother.", "After listening to bad investment advice from a friend, Jesse lost every cent.", "Sydney found a way for Jesse to get a ride home when their car broke down.", "Skylar's father had run out of gas, so Skylar went to take him some.", "Bailey turned Aubrey away. Aubrey didn't feel very appreciated by Bailey and frowned.", "Quinn kept in a good frame of mind last night to prepare for house work today.", "Riley returned to the store to return the shirt that didn't fit and find a different one.", "After hearing about a concert they wanted to go to, Robin bought a ticket.", "Jesse called them into the room knowing that it would be locked behind them and then filled with poison.", "Aubrey showed up and the asked the employees to come  forth if they are responsible for the broken pots.", "Quinn viewed the contract in simple terms so they wouldn't be confused by all the extra jargon.", "Robin wanted to jump in the pool. Kendall held Robin's phone.", "Sydney took their mom to the carnival and accidentally left their wallet and keys on a table.", "Kendall was not a nice person. Kendall took their friend's allowance every day.", "Casey watched a movie together with his friends at a movie theater. They were too excited and spoke loudly.", "Sasha worked two jobs. Sasha was always exhausted. It was difficult.", "Remy thought she was having a boy, but Remy gave birth to a baby girl.", "Lee was in love. They popped the question.", "After designing a new operating system, Kendall provided the interface to Jordan.", "Jordan wanted Bailey to win so much that he took the role of campaigning  for him.", "Addison was feeling ill, but they took the medicine too fast and it didn't sit well.", "Bailey sold her motorcycle after she was told that the odds of dying in an accident were high with motorcycles.", "Casey was with her friends and was trying to impress them, so she tossed her drink back.", "After Jan gave Bailey another shot, Bailey felt like crap and tried to bake banana bread.", "Before starting the pizza that she wanted for lunch, Sasha turned the oven on.", "Kai bought a Kindle from Amazon so they could read, but they ended up not using it.", "Robin placed an order at Burger King and Jordan got this and had to fill it.", "After working together for three months on a project at work, Sasha finally became Casey's friend.", "Taylor lost her car keys but unexpectedly, it was the dog that found it. Thus, she gave the dog a treat.", "Lee got Kendalls bike back from the shop, where it was repaired.", "Jordan went out to shovel the driveway. While walking, Jordan slipped on a patch of ice and fell.", "Jan considered the arrangements in detail finally deciding that Others should not be allowed to attend.", "After careful deliberation, Tracy skillfully robbed the local bank.", "After being treated unfairly by their employer, Jan decided to quit their job.", "Riley was really competitive and loved all outdoor sports.  Recently Riley had joined the athletics team and was keen to get a few races under their belt.", "Although it was an important review day before the final exam, Lee fell fast asleep during their first class of the day.", "Even though the patient's cancer was thought to be incurable, Taylor was able to improve the patient's health.", "Aubrey bought a large chocolate cake for her birthday, ate the whole thing by herself, and then ordered a pizza.", "The teacher asked Remy a question at school. Remy answered the question correctly.", "Kendall earned money to support their child, and soon they were able to buy them a present.", "After allowing the students to play 10 minutes longer for recess,  Tracy called the class back in.", "During an argument, Addison pulled out a knife and made a large incision in Bailey's arm.", "Jordan loved fire but this time he went too far and set his house on fire, he had to call the fire department.", "Lee ran a half marathon and decided to get a massage to recover.  Kendall was her masseuse who stretched her legs to reduce the tension.", "Aubrey knew that Riley had betrayed her. She deliberately filled Riley's tank with pure oxygen instead of the usual nonlethal mixture.", "Tracy wanted to surprise their girlfriend by showing up at the airport so they cancelled plans they had with others.", "Riley push Casey's fingers in the door jamb after they got into a fight over the remote control.", "Before Robin felt his oats, he needed to make some cookies and take care of his children.", "Sasha wanted a dog and decided to look for one to adopt at a local animal shelter.", "Riley got the wrong size of shoes, so they sold them on eBay.", "Jordan wanted to be educated about trans rights, so Robin gave Jordan a book to help them understand.", "Ash borrowed the money. They needed to pay their rent.", "Riley explained everything in training in great detail. Riley gets Jesse started with an easy task.", "Cameron was trying to get home from school so he decided to take a short cut and had to climb a fence quickly.", "Alex stayed home from school, but by the time Jan returned home from work she saw Alex was better.", "Ash gently moved Cameron an inch forward when the line opened up and Cameron was frozen in place in fear.", "Skylar and Lee have been planning a surprise party. Skylar asks Lee to bring their mother.", "Cameron and Taylor were best friends.  Taylor loved all types of music and Cameron loved music as well so they regularly went to concerts.", "After realizing the comments Jesse made were inappropriate, Jesse felt a little bad.", "Jan was new to the neighborhood and went out running one morning. Jan found new friends in the neighborhood on her run.", "Lee had a big crush on Alex and asked her to go to the movies with him.", "Jan slapped them in the face. They were ashamed of their behavior.", "Kendall hired Skylar to work for them as their personal assistant and was very pleased with their work as Skylar complied with Kendall's request for anything that Kendall needed.", "Tracy was relieved that her friend was alright.  She knew that Aubrey almost died.", "Remy started to hurt all over and decided to skip going to the doctor looking for self-care.", "Sydney was pregnant and trying to reach for something in a shop. Carson owns the store and prevented Sydney from reaching and got it for her.", "After saying no over and over again, Quinn finally agreed to do it.", "Sydney slow danced with Robin, and kissed Robin's lips.", "Remy saw Skylar's offended reaction and laughed at her, feeling like she got to her.", "Tracy was unsuccessful for a job due to their sex but Tracy fought for their rights, brought the company to court and won.", "Ash ran a red light because she needed to get to the hospital as soon as possible.", "Skylar kept Quinn from becoming the best. Skylar was always jealous of them.", "While others were fairly sure of their decision, Aubrey's idea caused a shadow of doubt in their mind.", "At the big race, someone came in first, Riley's father came second, then Quinn succeeded them.", "Bailey stopped the press. It had a paper jam.", "Jesse was driving to school and the car broke down. Jesse walked to go and get gas.", "Remy was making a presentation to their class. Remy did a great job.", "After having a genie pop into her room, Kai found out they could make a wish. They wished for lots of pretty things and a few exciting things.", "Sasha liked the meal very much, and gave thanks for all the wonderful flavors filling their mouth.", "Taylor lost track of time, not realizing that she had been playing pinball for hours.", "Jan wanted to drive back home from their place but realized she left her keys on the kitchen table.", "Austin enjoys staying home playing Xbox, PlayStation, and on his computer. Austin enjoys playing the game in the world.", "Sydney was arranging her desk in her office. Sydney got her files in order and put away.", "Kendall got the job done for the client in order to help solve the client's problems.", "Even though they were not supposed to drink, Bailey got too drunk and Bailey made a spectacle of themself.", "Wanting to see the country and get out of the city, Carson took a drive.", "Austin took them out for dinner after working hard and got promoted in the new job.", "Tracy had been assigned to work on the research problem and find solutions, so to begin, Tracy drew questions from the data.", "Skylar impeded Quinn's progress so that Quinn could not get to an important meeting on time.", "Aubrey could not allow the memory of her parents to be forgotten admist all the crazyness that happened in the war, she strived for it be remembered and in the end, she did it justice.", "Skylar skipped jubilantly down the sidewalk. They couldn't believe they finally succeeded in getting Bailey's number.", "Taylor saw the new video game Lee held in their hands and asked them if they could play.", "Tracy studied for the their test because this test determined whether or not she would graduate.", "Alex brought the tree to their yard, which had plenty of fruit to bear.", "Carson said thank you to his aunt for the strange and unwarranted gift she gave him.", "As a way to hurt her, Riley pushed Casey's fingers backwards.", "Cameron slit his thumb on a blade, and then sewed the wound together.", "James and Taylor went on a few dates and then Taylor suddenly stopped talking to James.", "Lee started his new job, which he had to get up early.", "Austin's home was destroyed in a freak storm so when friends and neighbours called to offer help Austin accepted every offer.", "Alex wipe Remy's eye with a tissue because she had been crying about the death of her friend.", "Robin started school at noon, but didn't show up until after 2 o'clock.", "Robin went to see Alex perform in the school play. Robin loved Alex's performance.", "After getting to know each other for a few months, Carson started dating Aubrey.", "Jesse was feeling very hungry but didn't like the school cafeteria food, so he left the premises with permission.", "Cameron was fired from the office due to the fraud Cameron allegedly had committed.  After the thorough investigation, Cameron was proved to be innocent. Ash welcomed Cameron back.", "The essay was due in just a few days and it was time to prepare so Quinn read an article.", "Quinn met his girlfriend for the first time and fell in love right when he saw her.", "Quinn played with Skylar and the dog in the park because there was nothing else to do.", "Casey's car broke down but her suitcase was inside. She had to carry it very far.", "Robin went with Jan's friends to school and was unaware Jan was planning a surprise party for later.", "Kendall had really missed their little brother Quinn.  He was so glad to see him.", "Ash picked the chicken entree for dinner at the wedding. He began to feel ill soon after he ate the chicken.", "Riley gave everybody the access code to the building so they could come up for the party.", "Carson looked away from Quinn after he saw her walking on the mall with her friends.", "Skylar came into the force on Tracy's behest. It was a good fit for them both."]